Revit 2027 API
BuiltInFailures.CutFailures.CutExactlyHalf Property
 Can't cut in half. Move plane towards either end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CutExactlyHalf { get; }
Public Shared ReadOnly Property CutExactlyHalf As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CutExactlyHalf {
	FailureDefinitionId^ get ();
}
static member CutExactlyHalf : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace